In [1]:
%load_ext sql

In [36]:
#kết nối database
connection_string = "mysql+pymysql://root:@localhost:3308/salesdb?charset=utf8"
%sql $connection_string

'Connected: root@salesdb'

In [7]:
%sql select * from customers limit 5

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321'),
 (2, 'Ana', 'Trujillo', 'México D.F.', 'Mexico', '(5) 555-4729'),
 (3, 'Antonio', 'Moreno', 'México D.F.', 'Mexico', '(5) 555-3932'),
 (4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (5, 'Christina', 'Berglund', 'Luleå', 'Sweden', '0921-12 34 65')]

In [8]:
import pandas as pd

### Cách 1

In [9]:
result = %sql select * from customers limit 5

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.

In [10]:
result

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321'),
 (2, 'Ana', 'Trujillo', 'México D.F.', 'Mexico', '(5) 555-4729'),
 (3, 'Antonio', 'Moreno', 'México D.F.', 'Mexico', '(5) 555-3932'),
 (4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (5, 'Christina', 'Berglund', 'Luleå', 'Sweden', '0921-12 34 65')]

In [14]:
df = pd.DataFrame(result, columns=['Id','FirstName','LastName','City','Country','Phone'])
df

   Id  FirstName  LastName         City  Country           Phone
0   1      Maria    Anders       Berlin  Germany     030-0074321
1   2        Ana  Trujillo  México D.F.   Mexico    (5) 555-4729
2   3    Antonio    Moreno  México D.F.   Mexico    (5) 555-3932
3   4     Thomas     Hardy       London       UK  (171) 555-7788
4   5  Christina  Berglund        Luleå   Sweden   0921-12 34 65

### Cách 2

In [15]:
from sqlalchemy.engine import create_engine

In [16]:
connection = create_engine(connection_string)

In [17]:
df2 = pd.read_sql('select * from customers limit 5', connection)
df2

   Id  FirstName  LastName         City  Country           Phone
0   1      Maria    Anders       Berlin  Germany     030-0074321
1   2        Ana  Trujillo  México D.F.   Mexico    (5) 555-4729
2   3    Antonio    Moreno  México D.F.   Mexico    (5) 555-3932
3   4     Thomas     Hardy       London       UK  (171) 555-7788
4   5  Christina  Berglund        Luleå   Sweden   0921-12 34 65

### Cách 3

In [18]:
df3 = result.DataFrame()
df3

   Id  FirstName  LastName         City  Country           Phone
0   1      Maria    Anders       Berlin  Germany     030-0074321
1   2        Ana  Trujillo  México D.F.   Mexico    (5) 555-4729
2   3    Antonio    Moreno  México D.F.   Mexico    (5) 555-3932
3   4     Thomas     Hardy       London       UK  (171) 555-7788
4   5  Christina  Berglund        Luleå   Sweden   0921-12 34 65

### sử dụng tham số

In [22]:
city_name = 'London'
%sql select * from customers where City = :city_name limit 5

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.

[(4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (11, 'Victoria', 'Ashworth', 'London', 'UK', '(171) 555-1212'),
 (16, 'Elizabeth', 'Brown', 'London', 'UK', '(171) 555-2282'),
 (19, 'Ann', 'Devon', 'London', 'UK', '(171) 555-0297'),
 (53, 'Simon', 'Crowther', 'London', 'UK', '(171) 555-7733')]

In [38]:
%%sql 
    select * 
    from customers 
    where City = :city_name 
    limit 5

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.

[(4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (11, 'Victoria', 'Ashworth', 'London', 'UK', '(171) 555-1212'),
 (16, 'Elizabeth', 'Brown', 'London', 'UK', '(171) 555-2282'),
 (19, 'Ann', 'Devon', 'London', 'UK', '(171) 555-0297'),
 (53, 'Simon', 'Crowther', 'London', 'UK', '(171) 555-7733')]

In [25]:
# Trường hợp truy vấn trên 1 dòng
result = %sql select * from customers where City = :city_name limit 5
result

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.

[(4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (11, 'Victoria', 'Ashworth', 'London', 'UK', '(171) 555-1212'),
 (16, 'Elizabeth', 'Brown', 'London', 'UK', '(171) 555-2282'),
 (19, 'Ann', 'Devon', 'London', 'UK', '(171) 555-0297'),
 (53, 'Simon', 'Crowther', 'London', 'UK', '(171) 555-7733')]

In [46]:
%%sql result <<
    select * 
    from customers 
    where City = :city_name 
    limit 5
#Truy vấn trên nhiều dòng

 * mysql+pymysql://root:***@localhost:3308/salesdb?charset=utf8
5 rows affected.
Returning data to local variable result